10/data/attachments/3a26ee0c8046c0de.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:friendsPageRequest>
            <nif:username>soap_friends_5641f6b7-83e6-4d8a-a818-da2b14bb7ba5</nif:username>
            <nif:pageInfo>
                <nif:page>-1</nif:page>
                <nif:size>1</nif:size>
                
            </nif:pageInfo>
            
        </nif:friendsPageRequest>
    </soapenv:Body>
</soapenv:Envelope>